app/views/experiments/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "teams" ON "users"."id" = "teams"."user_id" WHERE "teams"."experiment_id" = $1  [["experiment_id", 2]]
---
          <% @experiments.each do |experiment| %>
            <% experiment.users.each do |user| %>