app/views/experiments/show.html.erb

<% if @experiment.project_admin_id != current_user.id %>
  <% if @teams.each {|user| user.user.id == current_user.id} %>
---
SELECT "users".* FROM "users" INNER JOIN "teams" ON "users"."id" = "teams"."user_id" WHERE "teams"."experiment_id" = $1  [["experiment_id", 37]]


<% @experiment.observations.each do |observation| %>
---
SELECT "observations".* FROM "observations" WHERE "observations"."experiment_id" = $1  [["experiment_id", 37]]