app/controllers/experiments_controller.rb

SELECT "experiments".* FROM "experiments"
---
  def index
    @experiments = Experiment.all

INSERT INTO "experiments" ("project_admin_id", "title", "hypothesis", "summary", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "teams" ("user_id", "experiment_id", "approved?") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 100], ["experiment_id", 227], ["approved?", true]]
---
  def create
    @experiment = current_user.experiments.new(experiment_params)

    if @experiment.save
      Team.create(user_id: current_user.id, experiment_id: @experiment.id, approved?: true)

SELECT  "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."experiment_id" = $1 AND "teams"."approved?" = $2  [["experiment_id", 1], ["approved?", true]]
---
  def show
    @experiment = Experiment.find(params[:id])
    @user = User.find(params[:user_id])
    @teams = Team.where(experiment_id: @experiment.id, approved?: true)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
INSERT INTO "teams" ("user_id", "experiment_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 1], ["experiment_id", 44]]
UPDATE "experiments" SET "approved?" = $1, "updated_at" = $2 WHERE "experiments"."id" = $3  [["approved?", true], ["updated_at", 2016-09-17 00:35:14 UTC], ["id", 41]]
UPDATE "teams" SET "approved?" = $1 WHERE "teams"."id" = $2  [["approved?", true], ["id", 80]]
---
  def approval
    @user = User.find(params[:user_id])
    @experiment = Experiment.find(params[:experiment_id])
    @team = Team.create(user_id: @user.id, experiment_id: @experiment.id)
    @team.update_attributes(approved?: true)

SELECT  "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT $2  [["id", 187], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 100], ["LIMIT", 1]]
INSERT INTO "teams" ("user_id", "experiment_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 100], ["experiment_id", 187]]
---
  def application
    experiment = Experiment.find(params[:experiment_id])
    user = User.find(params[:user_id])
    Team.create(user_id: user.id, experiment_id: experiment.id)